
function hindiJoke() {
    const jokes = [`टीचर- इतने दिन कहां थे, स्कूल क्यों नहीं आए?

        गोलू- बर्ड फ्लू हो गया था मैम।

        टीचर- पर ये तो पक्षियों को होता है इंसानों को नहीं।

        गोलू- इंसान समझा ही कहां आपने...रोज तो मुर्गा बना देती हो..!!`,

        `बंता- तुम खाली पेट होने पर कितने केले खा सकते हो? 
        संता (कुछ पल सोचकर कहा)- मैं 6 केले खा सकता हूँ।
        बंता ने हँसते हुए जवाब दिया- गलत जवाब दोस्त,
        पहला केला खा लेने के बाद तुम्हारा पेट खाली कहां रहेगा !?
        इसलिए खाली पेट होने पर तुम केवल
        एक ही केला खा सकते हो। 
        संता घर पहुंचा और जाते ही बीवी से सवाल किया
        तुम खाली पेट होने पर कितने केले खा सकती हो?
        बीवी- मैं 4 केले खा सकती हूँ।
        संता (निराश स्वर में बोला)- अगर 6 कहती तो
        एक मस्त का Jokes सुनाता तुझे`,

        `ये वो दौर है जनाब
        जहां इंसान गिर जाये तो
        हँसी निकल जाती है
        और मोबाईल गिर जाये तो
        जान निकल जाती है`,

        `
        दो लड़कियां बस में सीट के लिए लड़ रही थीं
        कंडक्टर- अरे क्यों लड़ रही हो,
        जो उम्र में सबसे बड़ी है वो बैठ जाए
        फिर क्या, पूरे रास्ते दोनों खड़ी ही रहीं`,

        `लड़का- ओए पगली! हम तो दुश्मन भी शेर जैसे रखते हैं,
        तू है एक कोमल कली, मुझसे पंगा जरा सोच समझ कर ले,
        क्युंकि मैं एक शेर कि औलाद हुँ…
        लड़की- अच्छा तो एक बात बता  
        शेर घर पर आया था, या आंटी जंगल गयी थी…
        #सोलिड वाली बेईज्जती…`,

        `लडका : मैं उस लडकी से शादी करुंगा,
        जो मेहनती हो,
        सादगी से रहती हो,
        घर को संवारकर रखती हो,
        आज्ञाकारी हो।
        प्रेमिका: मेरे घर आ जाना,
        ये सारे गुण मेरी नौकरानी में है`,

        `एक भिखारी को 100 का नोट मिला
        वो फाइव स्टार होटेल में गया और भरपेट खाना खाया
        1500 रुपये का बिल आया, उसने मेनेजर से कहा, पैसे तो नहीं है
        मैनेजर ने पुलिस के हवाले कर दिया
        भिखारी ने पुलिस को 100 का नोट दिया, और छूट गया
        इसे कहते हैं...
        फाइनेन्सियल मैनेजमेन्ट विदाउट एमबीए इन इंडिया`,

        `एक लड़की एक लड़के के साथ बैठी थी,
        दूसरे दिन दूसरे लड़के के साथ बैठी थी,
        तीसरे दिन तीसरे लड़के के साथ बैठी थी,
        इस कहानी से तुम्हें क्या शिक्षा मिलती है?
        लड़के बदल जाते हैं पर लड़कियां नहीं`,

        `महिला- डॉक्टर साहब, मेरे पति नींद में
        बातें करने लगे हैं! क्या करूँ?
        डॉक्टर- उन्हें दिन में बोलने का
        मौका दीजिए!`, `अपने बदन को निहारकर देहाती पत्नी अपने पति से बोली...

        पत्नी-पहले मेरी कमर पेप्सी की बोतल की तरह थी

        सुसराल में आकर बुरा हाल हो गया...

        पति-अब भी तुम्हारी कमर पेप्सी की बोतल की तरह है।

        फर्क इतना है कि वह बोतल अब 300ml की नहीं, बल्कि 2 लीटर की है।`,

        `
        जोक्स - फोटो : iStock
        लड़की- सुन जानू, गूगल मेल होता है कि फीमेल...
        लड़का- बेबी फीमेल होता है...
        लड़की- क्यों..
        लड़का- क्योंकि अपना सेंटेन्स पूरा होने से पहले ही वो उसका सजेशन देना शुरू कर देता है.`,
        `
        कुछ अमीरों की चर्चा…
        किसी ने कहा मेरा बाथरुम 10 लाख का तो किसी ने 20 लाख को किसी ने 50 लाख का बताया
        और जब यही बात एक गाँव के आदमी से पूछी गई तो उसने बताया की मै जहा सुबह लोटा लेके जाता हूँ उस खेत की कीमत 7 करोड़ है
        और ऐसे बाथरुम तो हम रोज़ बदल देते है !!`,


        `पप्पू शराब पीकर गाड़ी चला रहा था,

        अचानक गाड़ी एक खम्बे से टकरा गयी

        पुलिस-बाहर निकल साले

        पप्पू-माफ़ कर दो दरोगा जी

        पुलिस-साले दारू पी के गाड़ी चलाता है, मुंह खोल

        पप्पू-अरे नहीं साब, पहले से खूब पी रखी है और कितना पिलाओगे।`,

        `प्रेमिका- मैं तुम्हारे लिए आग पर चल सकती हूं, नदी में कुद सकती हूं।

        प्रेमी- मैं भी तुमसे बहुत प्यार करता हूं, क्या तुम मुझसे मिलने आ सकती हो

        प्रेमिका- पागल हो क्या, धूप देखी  है कितनी तेज है, मैं काली पड़ गई तो`,
        `
        प्रेमिका- तुमको पता है कल मेरा बर्थडे है

        मुझे क्या गिफ्ट दोगे

        प्रेमी : जो तुम चाहो मेरी जान

        प्रेमिका- मुझे रिंग टाहिए

        प्रेमी- ठीक है रिंग दूंगा पर उठाना मत, मेरा बैलेंस कम है`,

        `
        लड़की का फोन आता है लड़के को
        लड़का- हां,  कितने का रिचार्ज करवाऊं ?
        लड़की- तुम्हे क्या लगता है मैं हर बार रिचार्ज करवाने के लिए ही फ़ोन करती हूँ क्या ?
        लड़का-तो ?
        लड़की-2 ड्रेस दिलवा दे ना` ]

    const randomIndex = Math.floor(Math.random() * jokes.length);
    const joke = jokes[randomIndex];
    document.getElementById("display").textContent = joke;
}
// hindiJoke();

// Marathi joke
function marathiJoke() {

    const marathijokeArray = [`प्रियकर :- मला कळत नाही, तुझ्या घरचे आपल्या लग्नाला एवढ्या लवकर कसे तयार झाले.?
    
    प्रेयसी :- त्यांनी मला विचारलं, पोरगं काय करतंय.?

    मी बोलले, पोटात लाथा मारतंय.!!

    😂🤣😂🤣😂🤣😂🤣`,

        `वैभव पहिल्यांदाच मुलगी बघायला गेला.

    मुलीचा बाप : बेटा, दारू पितोस का ?

    वैभव : ते नंतर, आधी पोहे, चहा

    आणि मुलगी बघणे तर होऊ द्या.

    मग बसू !!

    😆😆😆😂😂😂😂`,

        `मुलगा बाबांच्या लग्नाची सिडी बघत असतो..

    मुलगा: बाबा मला तुमच्या लग्नासारख्या माझ्या लग्नातपण

    आयटम गर्ल्स नाचवायच्या आहेत..

    आई: हरामखोर,

    त्या तुझ्या मावश्या आहेत..

    🤣🤣🤣🤣🤣🤣`,

        `जो नेहमी हसत असतो त्याला

    HAS MUKH म्हणतात…

    आणि ज्याचं हसणं कायमच बंद होत त्याला

    HUS BAND म्हणतात.

    😂🤣😂🤣😂🤣😂🤣`,

        `तुम्ही जर जग बदलू इच्छित असाल,

    तर अविवाहित असतांना बदला..

    लग्नानंतर तुम्ही टीव्ही चॅनेल पण

    बदलू शकत नाही.

    😂🤣😂🤣😂🤣😂🤣`,

        `काही शहाण्या मुलींचे फेसबुक आणि व्हॉट्सऍप वरील स्टेटस

    My dad is my real hero

    मग आमच म्हातार काय

    नीळू फुले आहे का.

    😂🤣😂🤣😂🤣😂🤣`,
        `सासू: कित्ती वेळा सांगितलंय

    बाहेर जातांना टिकली लावत जा

    सूनबाई: अहो सासूबाई, जीन्सवर

    कुणी टिकली नाही लावत

    सासू: अगं जीन्सवर नाही,

    कपाळावर लाव, भवाने…!

    😂🤣😂🤣😂🤣😂🤣`,

        `भिकारी : साहेब खूप भूक लागली आहे. ५ रुपये द्या ना

    पुणेकर : १०० रुपयाची नोट आहे ९५ रुपये सुट्टे आहेत का?

    भिकारी : हा आहे साहेब

    पुणेकर : आधी ते खर्च कर.

    😂🤣😂🤣😂🤣😂🤣`,

        `शिक्षक: उद्या ग्रुहपाठ नाही करून

    आणलास तर कोंबडा बनवेन..

    पिंट्या: ओके सर.. पण जरा झणझणीत बनवा..

    मी रॉयल स्टॅगचा खंबा घेऊन येतो…

    😂🤣😂🤣😂🤣😂🤣`,

        `कोणीतरी खरंच म्हणून गेलंय कि,

    आयुष्य फक्त २ दिवसाचं आहे..

    शनिवार आणि रविवार

    आणि हि गोष्ट आपल्याला सोमवारी पटते..

    😂🤣😂🤣😂🤣😂🤣`,


        `मुलगी फेसबुक वर स्टेटस टाकते…

    हॅलो फ्रेंड्स, मी मावशी झाले

    बंड्याने खाली Comment टाकली…

    कोणत्या हॉस्पिटलला?

    किती पगार आहे…?

    😂🤣😂🤣😂🤣😂🤣`,


        `पिंटया: गोव्याला चाललोय

    जातांना रस्त्यात बायकोला दरीत

    टाकून देणार आहे,

    चिंटया: माझी पण घेऊन जा आणि ढकल,

    पिंटया: तुझी येतांना ढकलली तर

    चालेल का?

    😂🤣😂🤣😂🤣😂🤣`,

        `लग्न झालेल्यांसाठी एक प्रश्न

    उत्तर फक्त हो किंवा

    नाही मध्ये द्यावे,

    आता तुमच्या बायकोने तुम्हाला

    मारणे बंद केले आहे का?

    😂🤣😂🤣😂🤣😂🤣`,

        `बायको: माझी मैत्रीण येणार आहे,

    दोन दिवस तुम्ही बाहेर झोपा..

    नवरा: बरं.. पण वचन दे,

    माझी मैत्रीण आली की तू पण दोन दिवस बाहेर झोपशील…!

    😂🤣😂🤣😂🤣😂🤣`,

        `तुमचे वडील गरीब असतील,

    तर ते तुमचं दुर्भाग्य..

    पण तुमचा सासरा गरीब असेल,

    तर तो तुमचाच गाढवपणा…!

    😂🤣😂🤣😂🤣😂🤣`,

        `मुलगी: मी शेजारच्या पांडुवर प्रेम करते

    आणि त्याच्याबरोबर पळून जात आहे..

    बाप: धन्यवाद !!!

    माझा पैसा आणि वेळ वाचवल्याबद्दल..

    मुलगी: अहो, बाबा मी पत्र वाचते आहे,

    बहुतेक आई पळाली…

    😂🤣😂🤣😂🤣😂🤣`,

        `बायकांना खुश ठेवणे खूप मुश्किल आहे,

    पुरुषांचे काय

    बायका दिसल्या कि, खुश होतात…!

    😂🤣😂🤣😂🤣😂🤣`,

        `डॉक्टर: आता तुमच्या बायकोची तब्बेत कशी आहे?

    नवरा: बरं वाटतंय तिला आता,

    आज सकाळपासून थोडं थोडं भांडायला लागलीय…!

    😂🤣😂🤣😂🤣😂🤣`,

        `बाई वर्गात व्याकरण शिकवत होत्या,

    बाई : मुलांनो तुकाराम लिहून दाखवा पाहू..

    बंडू : बाई, तुकारामाची तू पहिली का दुसरी?

    बाईंनी बंडूला झोड झोड झोडला..

    😂🤣😂🤣😂🤣😂🤣`,


        `रात्री भुताची मालिका बघून

    झाल्यावरचा संवाद:

    बायको: अहो, माझ्याकडे तोंड करून झोपा,

    मला भीती वाटतेय..

    नवरा: हा, म्हणजे मी भिऊन मरतो…

    😂🤣😂🤣😂🤣😂🤣`,


        `पुणेकर : काका पावशेर रताळे द्या

    दुकानदार : पिशवीत देऊ?

    पुणेकर : नाही नाही… पेन ड्राईव्ह आणलाय.

    त्यात “रताळे” नावाचा फोल्डर बनवा आणि टाका त्यात.

    😂🤣😂🤣😂🤣😂🤣`,

        `बऱ्याच वर्षांनी मित्राचा मेसेज आला.

    'हाय'

    मी उत्तर पाठवलं.

    'मी पण हाय'

    😂🤣😂🤣😂🤣😂🤣`,

        `तो हात धुवून तिच्या मागे लागला होता.
    .
    .
    .
    मग ...
    .
    .
    .
    शेवटी तिने तोंड धुवून दाखवलं, तेंव्हा कुठं प्रकरण शांत झालं.`];
    const randomIndexMarathi = Math.floor(Math.random() * marathijokeArray.length);
    const marathijoke = marathijokeArray[randomIndexMarathi];
    document.getElementById("display").textContent = marathijoke;
};

function englishJoke() {

    const englishjokeArray = [`What falls, but never needs a bandage? The rain.`,
        `I was going to tell you a joke about boxing but I forgot the punch line.`,
        `I'm not a fan of spring cleaning. Let's be honest, I'm not into summer, fall, or winter cleaning either.`,
        ` Why did the egg hide? It was a little chicken.`,
        ` What did the dirt say to the rain? If you keep this up, my name will be mud!`,
        ` Why couldn't the sunflower ride its bike? It lost its petals.`,
        ` What's an egg's favorite vacation spot? New Yolk City.`,
        ` I ate a sock yesterday. It was very time-consuming.`,
        ` What kind of candy do astronauts like? Mars bars.`,
        ` I wanted to buy some camo pants but couldn't find any.`,

        ` I ordered a chicken and an egg from Amazon. I'll let you know.`,
        ` What month is the shortest of the year? May, it only has three letters.`,
        ` What did the snail who was riding on the turtle's back say? Wheeeee!`,
        ` I was going to tell a time traveling joke, but you guys didn't like it.`,
        ` What do you call a lazy kangaroo? A pouch potato.`,
        ` I used to run a dating service for chickens, but I was struggling to make hens meet.`,
        ` Why do we tell actors to "break a leg?" Because every play has a cast.`,
        ` What does a pig put on dry skin? Oinkment.`,
        ` What do you call it when a snowman throws a tantrum? A meltdown.`,
        ` My uncle named his dogs Timex and Rolex. They're his watch dogs.`,
        ` Did you hear about the guy whose left side was cut off? He's all right now.`,
        ` How do you open a banana? With a mon-key.`,

        ` Which is faster, hot or cold? Hot, because you can catch cold.`,
        ` What did one plate say to the other plate? Dinner's on me.`,
        ` Why do oranges wear sunscreen? So they don't peel.`,
        ` My wife told me to stop acting like a flamingo, so I had to put my foot down.`,
        ` What do you call a pig that does karate? A pork chop.`,
        ` Where does Batman go to the bathroom? The batroom.`,
        ` What do you call a pony with a sore throat? A little horse.`,
        ` What did the left eye say to the right eye? Between you and me, something smells.`,
        ` What did the mama tomato say to the baby tomato? Catch up!`,
        ` Why didn't the melons get married? Because they cantaloupe.`,
        ` What do you call a fake noodle? An impasta.`,
        ` How did the pig get to the hogspital? In a hambulance.`,
        ` I'm so good at sleeping I can do it with my eyes closed!`,
        ` Why does Humpty Dumpty love autumn? Because he had a great fall.`,
        ` What happens when a strawberry gets run over crossing the street? Traffic jam.`,
        ` Why did the cow jump over the moon? The farmer had cold hands.`,
        ` A termite walks into a bar and says, "So, is the bar tender here?"`,
        ` How does an octopus go into battle? Well-armed.`,
        ` What do you call a pudgy psychic? A four-chin teller.`,

        `What do you get when you mix a cocker spaniel, a poodle, and a ghost? A cocker-poodle boo.`,
        ` How do celebrities stay cool? They have many fans.`,
        ` What does a pickle say when he wants to play cards? "Dill me in!"`,
        ` How much money does a pirate pay for corn? A buccaneer.`,
        ` Where do young trees go to learn? Elementree school.`,
        ` Why do bees have sticky hair? Because they use a honeycomb.`,
        ` How did the student feel when he learned about electricity? Totally shocked.`,
        ` What do you call a bee that can't make up its mind? A Maybe.`,
        ` Why was six afraid of seven? Because 7-8-9.`,
        ` If April showers bring May flowers, what do May flowers bring? Pilgrims.`,
        ` I tried to catch fog yesterday. Mist.`,
        ` What do you call a hippie's wife? Mississippi.`,
        ` Two peanuts were walking down the street. One was a-salted.`,
        ` How can you tell it’s a dogwood tree? By the bark.`,
        ` What did the buffalo say when his kid went to college? Bison.`,
        ` What did the mayonnaise say when the refrigerator door was opened? Close the door, I'm dressing.`,
        ` What's the stinkiest planet? Poopiter.`,

        ` What did one wall say to the other? I'll meet you at the corner.`,
        ` Why don't sharks eat clowns? Because they taste funny.`,
        ` A horse walks into a bar. The bartender says, "Why the long face?"`,
        ` What did the pirate say when he turned 80? Aye matey.`,
        ` What's black and white and goes round and round? A penguin in the washing machine.`,
        ` How do you organize a space party? You planet.`,
        ` Why couldn't the bicycle stand up by itself? It was two tired.`,
        ` Did you hear the rumor about butter? Well, I'm not going to spread it.`,
        ` Why did the student eat his homework? Because his teacher told him it was a piece of cake.`,
        ` What did one hat say to the other? You wait here, I'll go on ahead.`,
        ` What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks.`,
        ` I couldn't figure out why the baseball kept getting larger. Then it hit me.`,
        ` What do you call a boomerang that won’t come back? A stick.`,
        ` What did the full glass say to the empty glass? You look drunk.`,
        ` How do you stop a bull from charging? Cancel its credit card.`,
        ` Why don’t we see elephants hiding in trees? Because they’re really good at it.`,



        ` What’s the difference between a hippo and a zippo? One’s pretty heavy and the other’s a little lighter.`,
        ` Did you hear the one about the roof? Never mind, it's over your head.`,
        ` I used to hate facial hair...but then it grew on me.`,
        ` A cheese factory exploded in France. Da brie was everywhere.`,
        ` What's a ninja's favorite type of shoes? Sneakers.`,
        ` What's the best smelling insect? A deodor-ant.`,
        ` What do you call a bear without any teeth? A gummy bear.`,
        ` Why was the coach yelling at the vending machine? He wanted his quarter back.`,

    ];

    const randomIndexEnglish = Math.floor(Math.random() * englishjokeArray.length);
    const englishjokes = englishjokeArray[randomIndexEnglish];
    document.getElementById("display").textContent = englishjokes;
}